{
  "PCC-ME 203 Fluid Mechanics": {
    "type": "text",
    "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Apply mass and momentum conservation laws to fluid flows.\n- Understand the importance of dimensional analysis.\n- Determine velocity and pressure variations in various simple flows.\n- Analyze flow in water pumps and turbines.\n\nModule 1:\n- Definition of fluid, units and dimensions.\n- Newton’s law of viscosity.\n- Fluid properties: mass, density, specific volume, specific gravity, viscosity, surface tension, capillarity, vapor pressure, compressibility, bulk modulus.\n- Hydrostatics: fluid force on plane and curved surfaces, manometers, buoyancy, uniformly accelerated motion.\n\nModule 2:\n- Kinematics of fluid flow: generalized continuity equation, irrotational motion, Laplace equation solutions.\n- Streamlines, equipotential lines, flow nets.\n\nModule 3:\n- Dynamics of fluid flow: control volume and control surface, continuity equation, momentum equation.\n- Bernoulli’s equation and applications.\n\nModule 4:\n- Boundary layer: thickness, displacement thickness, momentum thickness, energy thickness.\n\nModule 5:\n- Laminar viscous flow through circular conduits (Couette and Poiseuille flow).\n- Turbulent flow through pipes.\n- Darcy-Weisbach equation, friction factor for smooth/rough pipes, Moody diagram.\n\nModule 6:\n- Dimensional analysis: need, methods, similitude, types of similitude, dimensionless parameters, model analysis.\n\nModule 7:\n- Forces on immersed bodies: separation, drag force, circulation, lift force.\n\nTextbooks:\n- Frank M. White, \"Fluid Mechanics\" (6th Ed.), Tata McGraw-Hill, 2008.\n- J.O. Wilkes, \"Fluid Mechanics for Chemical Engineers\", Prentice Hall, 1999.\n- Som & Biswas, \"Fluid Mechanics and Machinery\", TMH.\n- Cengal, \"Fluid Mechanics\", TMH.\n- Modi & Seth, \"Fluid Mechanics\", Standard Book House, Delhi.\n\nPractical Experiments (at least 8 from list):\n- Determine density and viscosity of oil.\n- Determine metacentric height of a floating body.\n- Measure coefficient of discharge of orifice and venturimeter.\n- Determine coefficient of discharge of V-notch and rectangular notch.\n- Determine friction factor for pipes.\n- Verify Bernoulli's theorem.\n- Find critical Reynolds number for pipe flow.\n- Determine minor losses in pipes (sudden enlargement, contraction, bends).\n- Demonstrate velocity and pressure variation in free and forced vortex.\n\nCourse Outcomes:\n- State Newton’s law of viscosity; explain fluid mechanics at rest and in motion.\n- Compute buoyancy force and analyze floating body stability.\n- Derive Euler’s equation and deduce Bernoulli’s equation.\n- Examine energy losses in pipe transitions and sketch energy gradient lines.\n- Evaluate pressure drop in pipe flow (Hagen–Poiseuille equation).\n- Distinguish between different flow types."
  },
   "PCC-ME 204 Applied Thermodynamics": {
    "type": "text",
    "text": "L:3\nT:1\nP:0\nCREDIT:4\n\nObjectives:\n- Learn the first law for reacting systems and heating value of fuels.\n- Understand gas and vapor cycles and their first/second law efficiencies.\n- Study properties of dry and wet air and psychrometric principles.\n- Learn gas dynamics of airflow and steam through nozzles.\n- Analyze reciprocating compressors with and without intercooling.\n- Evaluate performance of steam turbines.\n\nModule 1:\n- Solid, liquid, and gaseous fuels.\n- Stoichiometry, exhaust gas analysis.\n- First law analysis of combustion reactions.\n- Heat calculations using enthalpy tables.\n- Adiabatic flame temperature.\n- Chemical equilibrium and equilibrium composition (free energy method).\n\nModule 2:\n- Thermodynamic gas power cycles: Air-standard Otto, Diesel, Dual cycles.\n- Air-standard Brayton cycle, reheat, regeneration, intercooling.\n- Combined gas-vapor power cycles.\n- Vapor compression refrigeration cycles vs. Carnot cycle.\n- Refrigerants and their properties.\n\nModule 3:\n- Vapor power cycles: Basic Rankine, Rankine with superheat, reheat, regeneration.\n- Exergy analysis.\n- Supercritical and ultra-supercritical Rankine cycles.\n\nModule 4:\n- Basics of compressible flow.\n- Stagnation properties.\n- Isentropic flow of perfect gas through nozzle: choked, subsonic, supersonic.\n- Normal shocks.\n- Use of ideal gas tables for isentropic and shock flows.\n- Flow of steam/refrigerant through nozzles, supersaturation.\n- Compressible flow in diffusers, nozzle/diffuser efficiency.\n\nModule 5:\n- Steam turbines: velocity and pressure compounding.\n\nModule 6:\n- Reciprocating compressors: staging, optimal stage pressure ratio.\n- Effect of intercooling.\n- Minimum work for multistage compressors.\n\nTextbooks:\n- Sonntag, R.E., Borgnakke, C., Van Wylen, G.J., Fundamentals of Thermodynamics, 6th Ed., Wiley, 2003.\n- Jones, J.B., Duggan, R.E., Engineering Thermodynamics, Prentice-Hall of India, 1996.\n- Moran, M.J., Shapiro, H.N., Fundamentals of Engineering Thermodynamics, Wiley, 1999.\n- Nag, P.K., Engineering Thermodynamics, Tata McGraw-Hill, 1995.\n\nOutcomes:\n- Understand practical power and heat pump cycles.\n- Analyze energy conversion in thermal devices (combustors, coolers, nozzles, diffusers, turbines, compressors).\n- Explain phenomena in high-speed compressible flows."
  },
  "PCC-ME 205 Strength of Materials": {
    "type": "text",
    "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Understand stresses in simple geometries (bars, cantilevers, beams, shafts, cylinders, spheres) under simple loads.\n- Calculate elastic deformation in various simple geometries under different loading types.\n\nModule 1:\n- Deformation in solids: Hooke’s law.\n- Stress and strain: tension, compression, shear.\n- Elastic constants and relations.\n- Volumetric, linear, and shear strains.\n- Principal stresses and principal planes.\n- Mohr’s circle.\n- Theories of failure.\n\nModule 2:\n- Beams and transverse loading: shear force and bending moment diagrams.\n- Types of beam supports: simply supported, overhanging beams, cantilevers.\n- Theory of bending, bending stress distribution, neutral axis.\n- Shear stress distribution.\n- Point and distributed loads.\n\nModule 3:\n- Moment of inertia and polar moment of inertia.\n- Beam deflection (double integration method).\n- Slopes and deflection in beams.\n- Maxwell’s reciprocal theorem.\n\nModule 4:\n- Torsion: stresses and deformation in solid and hollow shafts, stepped shafts.\n- Shaft deflection with both ends fixed.\n- Stresses and deflection in helical springs.\n\nModule 5:\n- Axial and hoop stresses in cylinders under internal pressure.\n- Deformation of thick and thin cylinders.\n- Deformation in spherical shells under internal pressure.\n\nTextbooks:\n- Egor P. Popov, Engineering Mechanics of Solids, Prentice Hall of India, 2001.\n- R. Subramanian, Strength of Materials, Oxford University Press, 2007.\n- Ferdinand P. Beer, Russel Johnson Jr., John J. DeWolf, Mechanics of Materials, Tata McGraw Hill, 2005.\n\nPractical (minimum 8 experiments):\n- Hooke’s Law test.\n- Hardness Test: Rockwell, Brinell, Vickers.\n- Izod & Charpy Impact Test.\n- Bending Test.\n- Torsion Test.\n- Shear Test.\n- Compressive Strength Test.\n- Fatigue Test.\n- Maxwell’s reciprocal theorem verification.\n- Continuous beam deflection test.\n- Strain measurement.\n\nOutcomes:\n- Recognize load types and understand internal stresses in simple geometry components.\n- Evaluate strains and deformations from elastic stresses for simple loading cases."
  },
  "PCC-ME 206 Engineering Materials": {
    "type": "text",
    "text": "L:3\nT:1\nP:0\nCREDIT:4\n\nObjectives:\n- Understand correlation between internal structure of materials, their mechanical properties, and methods to quantify integrity and failure.\n- Interpret equilibrium phase diagrams and learn heat treatment methods for tailoring Fe-C alloy properties.\n\nModule 1:\n- Crystal structure: Unit cells, metallic crystal structures, ceramics.\n- Imperfections in solids: point, line, interfacial, and volume defects.\n- Dislocation strengthening mechanisms, slip systems, critically resolved shear stress.\n\nModule 2:\n- Alloys: substitutional and interstitial solid solutions.\n- Phase diagrams: binary diagram interpretation, microstructure development.\n- Reactions: eutectic, peritectic, peritectoid, monotectic.\n- Iron–carbide diagram: ledeburite, austenite, ferrite, cementite, cast iron.\n\nModule 3:\n- Mechanical property measurement: tensile, compression, torsion tests.\n- Young’s modulus; true vs engineering stress-strain curves.\n- Generalized Hooke’s law, yielding, yield strength, ductility, resilience, toughness, elastic recovery.\n- Hardness: Rockwell, Brinell, Vickers and relation to strength.\n- Intro to NDT (Non-Destructive Testing).\n\nModule 4:\n- Heat treatment of steel: annealing, tempering, normalizing, spheroidizing.\n- Isothermal transformation diagrams for Fe–C alloys, microstructure development.\n- Continuous cooling curves, TTT diagrams, austempering, martempering.\n- Surface treatments: case hardening, carburizing, nitriding, cyaniding, carbo-nitriding, flame/induction hardening, vacuum/plasma hardening.\n\nModule 5:\n- Alloying of steel.\n- Properties of stainless steel, tool steels, maraging steels.\n- Cast irons: grey, white, malleable, spheroidal.\n- Copper alloys: brass, bronze, cupro-nickel.\n- Aluminium alloys: Al–Cu–Mg.\n- Nickel-based superalloys, titanium alloys.\n\nTextbooks:\n- W.D. Callister, Materials Science and Engineering – An Introduction, 6th Ed., Wiley India, 2006.\n- Kenneth G. Budinski & Michael K. Budinski, Engineering Materials, PHI Pvt. Ltd., 2002.\n- V. Raghavan, Materials Science and Engineering, PHI Pvt. Ltd., 1999.\n- U.C. Jindal, Engineering Materials and Metallurgy, Pearson, 2011.\n\nOutcomes:\n- Identify crystal structures and defects in materials.\n- Tailor properties of ferrous and non-ferrous alloys.\n- Quantify mechanical integrity and predict failure in materials."
  },
  "PCC-ME 207 Instrumentation and Control": {
    "type": "text",
    "text": "L:3\nT:1\nP:0\nCREDIT:4\n\nObjectives:\n- Provide basic knowledge about measurement systems and components.\n- Learn about sensors for measurement of mechanical quantities.\n- Understand system stability and control.\n- Integrate measurement systems with processes for monitoring and control.\n\nModule 1:\n- Measurement systems and performance: configuration of a measuring system.\n- Correction methods for interfering/modifying inputs.\n- Accuracy, range, resolution, error sources, precision, error sensitivity.\n- Classification of errors, statistical analysis of experimental data.\n\nModule 2:\n- Instrumentation system elements: sensors for common engineering measurements.\n- Transducers: variable resistance, variable induction, variable capacitance, piezo-electric effects.\n- Displacement transducers.\n\nModule 3:\n- Signal processing and conditioning.\n- Correction elements.\n- Actuators: pneumatic, hydraulic, electric.\n\nModule 4:\n- Control systems: basic elements, open/closed loop.\n- Block diagram design.\n- Control methods: P, PI, PID – selection criteria.\n- Controller tuning.\n\nModule 5:\n- System models, transfer function, system response.\n- Frequency response, Nyquist diagrams and applications.\n- Practical group-based project.\n\nTextbooks:\n- W. Bolton, Instrumentation and Control Systems, 2nd Ed., Newnes, 2000.\n- Thomas G. Beckwith, Roy D. Marangoni, John H. Lienhard V, Mechanical Measurements, 6th Ed., Pearson, 2007.\n- Gregory K. McMillan, Process/Industrial Instruments and Controls Handbook, 5th Ed., McGraw-Hill, 1999.\n\nOutcomes:\n- Understand measurement of various quantities using instruments.\n- Evaluate instrument accuracy and range.\n- Apply control techniques for automatic device operation."
  }
}
