{
  "Heat Transfer": {
  "text": "📘 **Paper Code: 102502**\n📘 **Semester: V**\n\n📗 **Unit-1.0 Conduction Heat Transfer**\nIntroduction to Three Modes of Heat Transfer. Derivation of Heat Balance Equation. Steady One-Dimensional Heat Conduction in Cartesian, Cylindrical and Spherical Coordinates. Concept of Conduction and Film Resistances. Critical Thickness of Insulation. Lumped System Approximation and Biot Number. Heat Transfer through Pin Fins. Two-Dimensional Conduction Solutions for Steady and Unsteady Heat Transfer. Approximate Solutions to Unsteady Conduction using Heisler Charts.\n\n📙 **Unit-2.0 Convection Heat Transfer**\nHeat Convection and Basic Equations. Boundary Layer Concept. Forced Convection – External and Internal Flows. Natural Convection Heat Transfer. Dimensionless Parameters for Forced and Free Convection. Correlations for Forced and Free Convection. Approximate Solutions to Laminar Boundary Layer Equations (Momentum and Energy) for Internal and External Flows. Estimation of Heat Transfer Rates in Laminar and Turbulent Flow using Appropriate Correlations.\n\n📕 **Unit-3.0 Radiation Heat Transfer**\nInteraction of Radiation with Materials. Radiative Properties and Definitions. Stefan–Boltzmann Law. Black Body and Gray Body Radiation. Calculation of Radiation Heat Transfer between Surfaces using Radiative Properties. View Factors and Radiosity Method.\n\n📒 **Unit-4.0 Heat Exchangers**\nTypes of Heat Exchangers. Analysis and Design of Heat Exchangers using Log Mean Temperature Difference (LMTD) Method and Effectiveness–NTU (ε–NTU) Method.\n\n📓 **Unit-5.0 Boiling and Condensation**\nBoiling Heat Transfer. Pool Boiling Curve. Condensation Heat Transfer.\n\n📔 **Unit-6.0 Mass Transfer**\nIntroduction to Mass Transfer. Similarity between Heat Transfer and Mass Transfer."
},
  "Fluid Machinery": {
  "text": "📘 **Paper Code: 102501**\n\n📗 **Unit-1.0 Introduction to Fluid Machinery**\nIntroduction and Classification of Fluid Machinery.\n\n📙 **Unit-2.0 Dynamic Action of Fluid Jet**\nImpact of Fluid Jet on Fixed and Moving Flat Plates. Impact of Jet on Fixed and Moving Curved Vanes. Flow over Radial Vanes. Jet Propulsion.\n\n📕 **Unit-3.0 Turbomachinery Theory**\nEuler’s Fundamental Equation of Turbomachinery. Degree of Reaction.\n\n📒 **Unit-4.0 Hydraulic Turbines**\nIntroduction and Classification of Hydraulic Turbines. Impulse Turbines – Constructional Details, Velocity Triangles, Power and Efficiency Calculations. Reaction Turbines – Constructional Details, Working Principle, Velocity Triangles, Power and Efficiency Calculations. Draft Tube, Cavitation and Governing of Turbines.\n\n📓 **Unit-5.0 Similarity and Model Testing**\nPrinciple of Similarity in Fluid Machinery. Unit Quantities and Specific Quantities. Model Testing and Selection of Hydraulic Turbines.\n\n📔 **Unit-6.0 Pumps**\nPositive Displacement Pumps: Reciprocating Pumps – Working Principle, Classification, Slip, Indicator Diagram, Effect of Friction and Acceleration, Theory of Air Vessel, Performance Characteristics. Gear Pump and Screw Pump.\n\nRotodynamic Pumps: Introduction and Classification. Centrifugal Pump – Main Components, Working Principle, Velocity Triangles, Effect of Blade Shape, Specific Speed, Head, Power and Efficiency Calculations, Minimum Starting Speed, Multistage Pumps, Performance Characteristics and Comparison with Reciprocating Pumps."
},
  "Manufacturing Processes": {
  "text": "📘 **Paper Code: 102504**\n\n📗 **Unit-1.0 Casting and Moulding**\nConventional Manufacturing Processes. Metal Casting Processes and Equipment. Heat Transfer and Solidification. Shrinkage, Riser Design, Casting Defects and Residual Stresses.\n\n📙 **Unit-2.0 Metal Forming Processes**\nIntroduction to Bulk and Sheet Metal Forming. Plastic Deformation and Yield Criteria. Fundamentals of Hot and Cold Working Processes. Load Estimation for Bulk Forming Processes – Forging, Rolling, Extrusion and Drawing. Sheet Metal Forming Processes – Shearing, Deep Drawing and Bending. Principles of Powder Metallurgy.\n\n📕 **Unit-3.0 Metal Cutting and Machining**\nMetal Cutting Processes – Single Point and Multi-Point Cutting Tools. Orthogonal Cutting and Force Components. Chip Formation, Tool Wear and Tool Life. Surface Finish and Surface Integrity. Machinability. Cutting Tool Materials, Cutting Fluids and Tool Coatings. Machining Operations – Turning, Drilling, Milling and Finishing Processes. Introduction to CNC Machining.\n\n📒 **Unit-4.0 Joining and Additive Manufacturing**\nJoining and Fastening Processes. Physics of Welding, Brazing and Soldering. Design Considerations in Welding. Solid-State and Liquid-State Joining Processes. Adhesive Bonding. Additive Manufacturing – Rapid Prototyping and Rapid Tooling.\n\n📓 **Unit-5.0 Machine Tools and Finishing Processes**\nLathe: Principle, Types and Operations. Turret and Capstan Lathes, Semi-Automatic and Automatic Lathes, Tool Layout.\nShaper, Slotting and Planer Machines – Operations and Drives.\nMilling Machines: Milling Cutters, Up and Down Milling, Dividing Head and Indexing, Maximum Chip Thickness and Power Requirement.\nDrilling and Boring Operations. Reaming Tools. Geometry of Twist Drill.\nGrinding: Grinding Wheel, Abrasives, Cutting Action, Grinding Wheel Specification, Wheel Wear, Fracture Wear, Dressing and Truing. Maximum Chip Thickness and Grit Criteria. Flat and Cylindrical Grinding, Centerless Grinding. Superfinishing Processes – Honing, Lapping and Polishing."
},
  "Kinematics of Machine": {
  "text": "📘 **Paper Code: 102503**\n\n📗 **Unit-1.0 Introduction to Mechanisms**\nClassification of Mechanisms. Basic Kinematic Concepts and Definitions. Degree of Freedom and Mobility. Grashof’s Law. Kinematic Inversions of Four-Bar Chain and Slider-Crank Chain.\n\n📙 **Unit-2.0 Kinematic Analysis of Plane Mechanisms**\nDisplacement, Velocity and Acceleration Analysis of Simple Mechanisms. Graphical Velocity Analysis using Instantaneous Centers. Kinematic Analysis of Slider-Crank Mechanism. Coriolis Component of Acceleration.\n\n📕 **Unit-3.0 Friction Devices**\nBelt Drives. Clutches. Shoe Brakes. Band Brakes and Block Brakes.\n\n📒 **Unit-4.0 Gears and Gear Trains**\nGear Terminology. Involute and Cycloidal Gear Profiles. Gear Parameters. Fundamental Law of Gearing and Conjugate Action. Spur Gear Contact Ratio and Interference/Undercutting. Gear Trains – Analysis of Simple, Compound, Reverted and Epicyclic Gear Trains.\n\n📓 **Unit-5.0 Balancing of Rotating Masses**\nBalancing of a Single Rotating Mass in the Same Plane. Balancing of Several Rotating Masses in the Same Plane. Balancing of Several Rotating Masses in Different Planes using Two Revolving Masses in Suitable Planes.\n\n📔 **Unit-6.0 Governors**\nWatt Governor, Porter Governor, Proell Governor and Hartnell Governor. Effect of Friction. Controlling Force. Governor Effort and Power. Sensitivity and Isochronism."
}
}
