{
"100 701 Induction Program": {
  "type": "text",
  "text": "L:3\nT:0\nP:0\nCREDIT:0\n\nType: Mandatory\nDuration: 3 weeks\n\nDescription:\nInduction program offered at the start of the first year to help students acclimatize to the academic environment and campus culture.\n\nComponents:\n1. Physical activity\n2. Creative arts\n3. Universal human values\n4. Literary activities\n5. Proficiency modules\n6. Lectures by eminent people\n7. Visits to local areas\n8. Familiarization with department/branch and innovations"
},
"102 701 Internal Combustion Engines": {
  "type": "text",
  "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Familiarize with IC engine terminology.\n- Understand basics of IC engines.\n- Study combustion processes and influencing parameters.\n- Learn about IC engine systems and application-specific engine types.\n\nDetailed Contents:\nModule 1: Basics of IC Engines – Components, classification (2-stroke, 4-stroke SI/CI engines), working principle, valve timing diagram, ideal cycles, fuel-air cycles.\nModule 2: Engine performance tests – Purpose, types, measurement of power, system & performance parameter evaluation.\nModule 3: Combustion in SI & CI engines – Stages, abnormal combustion, knocking/detonation factors, effects & control, combustion chamber designs.\nModule 4: Fuel supply systems – SI & CI (carburetors, port fuel injection, direct injection, common rail injection).\nModule 5: Ignition systems – Battery/magneto ignition, spark plug, firing order, governing methods; Lubrication & cooling systems – Wet/dry sump, crankcase ventilation, liquid vs air cooling.\nModule 6: Measurement & testing – IP, BP, fuel consumption, emissions; Willan’s Line Method, Morse Test; Brake thermal efficiency, BSFC, VCR engines, heat balance sheet; Emission control – catalytic converter.\nModule 7: Supercharging, lubrication, cooling.\n\nText Books:\n- Obert E.F., \"Internal Combustion Engines and Air Pollution\".\n- Heisler H., \"Advanced Engine Technology\".\n- Heywood J.B., \"Internal Combustion Engine Fundamentals\".\n- Heldt P.M., \"High Speed Combustion Engines\".\n- Stockel M.W., Stockel T.S., Johanson C., \"Auto Fundamentals\".\n\nCourse Outcomes:\n- Understand IC engine basics and operational characteristics.\n\nLaboratory:\n- Study cross-sectional view of IC engine.\n- Determine calorific value, flash & fire points of fuel.\n- Study valve timing diagram of 4-stroke engine.\n- Prepare heat balance sheet for diesel and petrol engines.\n- Performance evaluation of multi-cylinder diesel engine.\n- Conduct Morse test on multi-cylinder petrol engine to find friction power."
},
"102 702 Refrigeration and Air Conditioning": {
  "type": "text",
  "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Familiarize with refrigeration and air conditioning terminology.\n- Understand basic refrigeration processes.\n- Learn psychrometric concepts and applied psychrometry.\n- Develop skills to model, analyze, and design refrigeration and air conditioning systems.\n\nDetailed Contents:\nModule 1: Air refrigeration systems – Refrigeration machine, heat pump, COP, ideal refrigeration cycle, Bell–Coleman cycle, open/closed systems, aircraft applications.\nModule 2: Compression systems – Vapour compression cycle, merits/demerits vs air refrigeration, performance factors, subcooling/superheating, wet/dry compression, multistage systems, intercooler, flash chamber, accumulator, heat exchanger.\nModule 3: Vapour absorption systems – Simple/modified systems, Electrolux refrigerator, COP of heat-operated systems.\nModule 4: Special refrigeration systems – Absorption, cascade, vortex, thermoelectric, steam jet.\nModule 5: Refrigerants – Classification, nomenclature, primary/secondary, common refrigerant properties (physical, chemical, thermodynamic), selection, leakage detection.\nModule 6: Psychrometry – Air-vapour properties, wet/dry bulb, dew point, humidity measures, degree of saturation, psychrometric relations, charts, processes, evaporative cooling.\nModule 7: Air conditioning – Comfort requirements, thermodynamics of human body, heating/cooling load estimation, cooling coil capacity, humidification/dehumidification units, central/year-round AC, humidity/temp control, industrial AC applications.\nModule 8: Enthalpy potential – Air washers, cooling towers, evaporative condensers, cooling/dehumidifying coils.\n\nCourse Outcomes:\n- Understand working principles of refrigeration and air-conditioning systems.\n\nText Books:\n- Gosney W.B., \"Principles of Refrigeration\".\n- Stoecker W.F., Jones J.W., \"Refrigeration and Air Conditioning\".\n- Arora C.P., \"Refrigeration and Air Conditioning\".\n- Kuehn T.H., Ramsey J.W., Threlkeld J.L., \"Thermal Environmental Engineering\".\n\nPractical:\n- Determine COP of vapour compression system.\n- Determine COP of vapour absorption apparatus.\n- Determine COP of heat pump.\n- Evaluate cooling tower performance.\n- Study components and performance of room AC under varying conditions.\n- Determine COP of Electrolux refrigerator.\n- Study refrigerator compressor and throttling valve."
},
"102 703 Computer Aided Design": {
  "type": "text",
  "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Provide an overview of computer utilization in mechanical component design.\n\nDetailed Contents:\nModule 1: Fundamentals of Computer Graphics – Product cycle, sequential/concurrent engineering, CAD, system architecture, computer graphics, coordinate systems, 2D/3D transformations, viewing transformation.\nModule 2: Geometric Modelling – Curve representation (Hermite, Bezier, B-spline, rational), surface modelling techniques (surface patch, Coons/bicubic patches, Bezier, B-spline surfaces), solid modelling techniques (CSG, B-rep).\nModule 3: Visual Realism – Hidden line/surface/solid removal algorithms, shading, colouring, animation.\nModule 4: Assembly of Parts – Assembly modelling, positional/orientation interferences, tolerance analysis, mass property calculations, mechanism simulation, interference checking, CAD standards (GKS, OpenGL), data exchange standards (IGES, STEP, CALS), communication standards.\n\nCourse Outcomes:\n- Ability to use computer and CAD software for mechanical component modelling.\n\nText Books:\n- Ibrahim Zeid, \"Mastering CAD CAM\".\n- C. McMahon, J. Browne, \"CAD/CAM Principles\".\n- W.M. Neumann, R.F. Sproul, \"Principles of Computer Graphics\".\n- D. Hearn, M.P. Baker, \"Computer Graphics\".\n\nPractical:\n- Initialize graphics package; set paper size, space, limits, units; use snap/grid.\n- Draw primitives (line, arc, circle, ellipse, triangle, etc.).\n- Draw flange.\n- Draw bushing assembly.\n- Apply dimensioning and text.\n- Set and apply layers.\n- Create isometric and orthographic projections.\n- View in 3D.\n- Remove hidden lines; shading and rendering."
},
"102 704 Finite Element Analysis": {
  "type": "text",
  "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Illustrate the principle of mathematical modeling of engineering problems.\n- Introduce the basics and applications of the Finite Element Method (FEM).\n\nDetailed Contents:\nModule 1: Historical background, mathematical modeling of field problems, governing equations, discrete/continuous models, boundary and initial value problems, Weighted Residual Methods, variational formulation, Ritz technique, basic concept of FEM.\nModule 2: One-dimensional second-order equations, discretization, linear and higher-order elements, shape functions derivation, stiffness matrix and force vectors, assembly, solutions for solid mechanics and heat transfer, longitudinal vibration/mode shapes, fourth-order beam equation, transverse deflections, natural frequencies.\nModule 3: Two-dimensional equations, variational formulation, FEM formulation, triangular elements (shape functions, elemental matrices, RHS vectors), thermal problems, torsion of non-circular shafts, quadrilateral/higher order elements, plane stress/strain, body forces, thermal loads, plate/shell elements.\nModule 4: Natural coordinate systems, isoparametric elements, numerical integration, plane stress applications, matrix solution techniques, dynamic problems, introduction to FE software.\n\nCourse Outcomes:\n- Understand FEM formulation and apply it to structural and thermal problems.\n\nText Books:\n- Reddy J.N., \"An Introduction to Finite Element Method\" (3rd ed.).\n- Seshu P., \"Text Book of Finite Element Analysis\".\n- Rao S.S., \"The Finite Element Method in Engineering\" (3rd ed.).\n- Chandrupatla & Belegundu, \"Introduction to Finite Elements in Engineering\" (3rd ed.).\n\nPractical:\n- Force/stress analysis using link elements in trusses, cables.\n- Stress/deflection analysis in beams with different support conditions.\n- Stress analysis of flat plates and simple shells.\n- Stress analysis of axi-symmetric components.\n- Thermal stress and heat transfer analysis of plates.\n- Thermal stress analysis of cylindrical shells.\n- Vibration analysis of spring-mass systems.\n- Modal analysis of beams.\n\nSoftware:\n- ANSYS, SIMULIA, ABAQUS, MATLAB."
},
"102 705 Automobile Engineering": {
  "type": "text",
  "text": "L:3\nT:0\nP:3\nCREDIT:4.5\n\nObjectives:\n- Understand the construction and working principles of various automobile parts.\n\nDetailed Contents:\nModule 1: Types of automobiles, vehicle construction and layouts, car body styles, chassis, frame, body, vehicle aerodynamics, IC engine components/functions/materials, variable valve timing (VVT), front engine front-wheel drive, front engine rear-wheel drive, four-wheel drive.\nModule 2: Engine auxiliary systems, electronic injection for SI and CI engines, unit injector, rotary distributor, common rail direct injection, transistor-based coil ignition, capacitive discharge ignition, turbochargers (WGT, VGT), emission control via 3-way catalytic converter, Euro & BS norms.\nModule 3: Transmission systems, clutch types (cone, single plate, multi-plate, diaphragm spring, centrifugal, electromagnetic), gearboxes (manual, automatic), overdrive, transfer box, transaxles, flywheel, torque converter, propeller shaft, slip/universal joints, differential & rear axle, Hotchkiss drive, torque tube drive.\nModule 4: Steering geometry, types of steering gear box, power steering, front axle types, suspension systems, leaf spring, pneumatic & hydraulic braking systems, ABS, electronic brake force distribution (EBD), traction control.\nModule 5: Caster, camber, king pin inclination, toe-in, toe-out, full-floating, three-quarter floating, semi-floating rear axles.\nModule 6: Alternative fuels—natural gas, LPG, biodiesel, bio-ethanol, gasohol, hydrogen; modifications, performance, combustion & emissions in SI/CI engines, electric & hybrid vehicles, fuel cell applications.\n\nCourse Outcomes:\n- Understand the function of each automobile component and the overall vehicle performance.\n\nText Books:\n- Kirpal Singh, \"Automobile Engineering\" (7th ed.).\n- Jain K.K. & Asthana R.B., \"Automobile Engineering\".\n- Heitner J., \"Automotive Mechanics\" (2nd ed.).\n- Heisler H., \"Advanced Engine Technology\".\n\nPractical:\n- Study & report on automotive clutches.\n- Study & report on automotive transmission systems.\n- Study & report on automotive drivelines & differentials.\n- Study & report on multi-cylinder diesel & petrol engines.\n- Study & report on fuel supply systems.\n- Study & report on engine cooling & lubrication systems.\n- Study & report on automotive suspension systems.\n- Study & report on automotive steering systems.\n- Study & report on automotive brake systems."
}
}