{
  "Engineering Chemistry": {
    "type": "text",
    "text": "📘 COURSE CODE: 100109\n📗 Subject: Engineering Chemistry\n\n📚 UNIT 1.0 – Atomic and Molecular Structure (8 hrs)\nElectromagnetic radiations, Dual nature of electron and Heisenberg uncertainty Principle. Photoelectric effect, Planck's theory. Principles for the combination of atomic orbitals to form a molecular diagram of molecular orbitals. Bent's rule, VSEPR theory (typical example), co-ordination numbers and geometries. Isomerism in transition metal compounds. Metal Carbonyls; Synthesis and Structure.\n\n📚 UNIT 2.0 – Spectroscopy (6 hrs)\nPrinciple of rotational and vibrational spectroscopy, selection rule for application in diatomic molecules, elementary idea of electronic spectroscopy, UV-VIS spectroscopy with related rules and its applications. Basic Principle of nuclear Magnetic resonance spectroscopy with applications.\n\n📚 UNIT 3.0 – Electrochemistry and Fuels (6 hrs)\nNernst equation, EMF and electrochemical cell, the introduction of corrosion, corrosion mechanism, types of corrosion, water line corrosion, stress corrosion, pitting corrosion, Lead acid storage cell, leclanche cell. Calorific value of fuels, proximate and ultimate analysis of coals, fuel cells, Bio fuels.\n\n📚 UNIT 4.0 – Water Chemistry (8 hrs)\nHardness of water, estimation of water hardness by EDTA and Alkalinity method. Removal of the hardness of water- soda lime process, zeolite process, Ion exchange process, Boiler problem, sludge, and scale formation, priming and foaming, Boiler corrosion, and Caustic embrittlement.\n\n📚 UNIT 5.0 – Polymer and Plastics (8 hrs)\nPolymerization techniques (free radical, ionic, and co-ordination mechanism). Preparation, properties, and technical application of phenol-formaldehyde resins, elastomers, synthetic rubbers (Buna-S, Buna-N, neoprene). Inorganic polymers, Silicones, adhesives, epoxy resins. The structural difference between thermoplastic and thermosetting plastics, the importance of commercially important thermoplastics and thermosets: Polyethylene, Polyvinyl chloride, Polystyrene.\n\n📚 UNIT 6.0 – Organic Reactions and Synthesis of A Drug Molecule (6 hrs)\nIntroduction to intermediates and reactions involving Substitution, Addition, Elimination, Oxidation-Reduction. Diels–Alder cyclization and epoxide ring opening reactions, synthesis of commonly used drug molecules like Aspirin.\n\n📘 TEXT / REFERENCE BOOKS:\n1. Engineering Chemistry – Jain & Jain (Dhanpat Rai)\n2. A Textbook of Engineering Chemistry – S.S. Dara & S.S. Umare (S. Chand)\n3. Engineering Chemistry – Wiley India Editorial Team\n4. Organic Chemistry – Morrison and Boyd\n5. Inorganic Chemistry – J.D. Lee\n6. Engineering Chemistry – O.P. Mishra (Asia Publishing House)"
  },
  "Engineering Mathematics-I": {
    "type": "text",
    "text": "📘 COURSE CODE: 100102\n📗 Subject: Engineering Mathematics-I\n\n📚 UNIT 1.0 – Linear Algebra-I (7 hrs)\nElementary Row operations, Gauss-Jordan Method for finding the inverse of Matrix, Complex Matrix: Hermitian, Skew Hermitian and Unitary Matrix, Vector space, Sub Spaces, Linear dependence and Independences of Vectors, Linear Span, Basis, Dimension, Extension of basis of subspace, The rank of a matrix, Row and column space, Solvability of system of linear equations.\n\n📚 UNIT 2.0 – Linear Algebra-II (7 hrs)\nLinear Transformations, Kernel and Range of linear transformation, Matrix Representation of a linear transformation, Rank-Nullity Theorem, Eigen Value and Eigen Vectors, Properties of Eigen vectors, Eigen Bases, Orthogonal Transformation, Similarity Transformation, Matrix Diagonalization, Cayley-Hamilton Theorem.\n\n📚 UNIT 3.0 – Calculus for Single Variable (7 hrs)\nIndeterminate form, L'Hospital Rule, Rolle's Theorem, Mean Value Theorem, Expansion of function (single variable), Taylor and Maclaurin Series, Riemann Integration, Riemann Sum, Improper Integrals, Beta and Gamma function and their properties.\n\n📚 UNIT 4.0 – Multivariable Calculus (Differentiation) (7 hrs)\nFunction with two or more variable, Limit, continuity and Partial differentiation, Total Differentiation, Taylor's and Maclaurin's series for function with two variables, Jacobian, Maxima and Minima, Method of Lagrange's multiplier.\n\n📚 UNIT 5.0 – Multivariable Calculus (Integration) (7 hrs)\nDouble Integral, change of order of integration, Triple integral, Change of Variable in a Double and Triple Integrals, Change to polar coordinate, Change to cylindrical coordinate, Change to spherical polar coordinate, Application to area and volume using double and triple integral.\n\n📚 UNIT 6.0 – Vector Calculus (7 hrs)\nScalar and vector fields, Gradient, Directional derivative, Divergence, Curl and their properties, Line integral, Green's theorem in plane (without proof), Surface integral, Stoke's theorem (without proof), Volume Integral, Gauss-Divergence theorem (without proof).\n\n📘 TEXT / REFERENCE BOOKS:\n1. Mathematics-I – Reena Garg, Khanna Book Publishing, ISBN: 9391505171\n2. Advanced Engineering Mathematics – Chandrika Prasad & Reena Garg, ISBN: 9789386173522\n3. Higher Engineering Mathematics – B.V. Ramana, Tata McGraw Hill, ISBN: 9780070634190\n4. Advanced Engineering Mathematics – S.R.K. Iyengar, R.K. Jain, Narosa, ISBN: 9788184875607\n5. Advanced Engineering Mathematics – Erwin Kreyszig, 9th Ed., John Wiley & Sons, 2006"
  },
  "English (Communication Skills)": {
  "type": "text",
  "text": "📘 COURSE CODE: 100108\n📗 Subject: English (Communication Skills)\n\n📚 UNIT 1.0 – Vocabulary Building (7 hrs)\nNature of Word Formation; Root Word and Morpheme; Prefix and Suffix; Foreign Expressions in English; Synonym and Antonym; Homophone and Homograph; Abbreviation and Acronym.\n\n📚 UNIT 2.0 – Basic Writing Skills (7 hrs)\nParts of Speech: Types of Words; Structures of Sentence; Kind of Sentence; Phrase and Clause; Punctuation Marks; Capitalization; Tenses: Present, Past and Future; Voices: Active and Passive; Formation of Questions using Primary Auxiliaries, Modals and Wh-Words.\n\n📚 UNIT 3.0 – Common Errors in English (7 hrs)\nArticles; Prepositions; Modifiers; Subject-Verb Agreement; Noun-Pronoun agreement; Redundancies; Cliches; Spelling Error.\n\n📚 UNIT 4.0 – Principles of Appropriate Writing (7 hrs)\nDefining: Describing, Classifying and Exemplifying; Introduction, Body, and Conclusion; References, Quotations and Illustrations; Organizing the Paragraphs in a Document; 7Cs of the Professional Writing: Clear, Concise, Concrete, Correct, Coherent, Complete and Courteous.\n\n📚 UNIT 5.0 – Practices of Formal Writing (7 hrs)\nFormal Letter: Cover-Letter and Application; Resume Writing; Report Writing; Minutes of Meeting; Memorandum; Notice; Essay Writing: Personal and Impersonal; Email Writing Etiquettes; Article Writing; Writing for Current Social Media.\n\n📚 UNIT 6.0 – Comprehension of Written English (7 hrs)\n*Of Studies* (Essay) by Sir Francis Bacon; *The Sun Rising* (Poem) by John Donne; *The Last Leaf* (Story) by O. Henry; Unseen/Untaught Passage.\n\n📘 TEXT / REFERENCE BOOKS:\n1. Technical Communication – Rizvi, McGraw Hill\n2. High School English Grammar and Composition – Wren and Martin\n3. Contemporary English Grammar – J.D. O’Connor\n4. Word Power Made Easy – Norman Lewis\n5. English Vocabulary in Use – Michael McCarthy and Felicity O'Dell"
},
"Engineering Drawing": {
  "type": "text",
  "text": "📘 COURSE CODE: 100104\n📗 Subject: Engineering Drawing\n\n📚 UNIT 1.0 – Introduction to Engineering Drawing (7 hrs)\nPrinciples of Engineering Graphics and Their Significance, Usage of Drawing Instruments, Lettering, Conic Sections including the Rectangular Hyperbola (General Method Only); Cycloid, Epicycloid, Hypocycloid and Involute; Scales: Plain, Diagonal and Vernier Scales.\n\n📚 UNIT 2.0 – Orthographic Projections (7 hrs)\nPrinciples of Orthographic Projections - Conventions - Projections of Points and Lines Inclined to Both Planes; Projections of Planes Inclined Planes; Auxiliary Planes.\n\n📚 UNIT 3.0 – Projections of Regular Solids (7 hrs)\nTypes of Solids, Projections of Solids (Prism, Pyramids, Cone, and Cylinder) Inclined to Both the Planes – Auxiliary Views; Draw Simple Annotation, Dimensioning and Scale.\n\n📚 UNIT 4.0 – Sections and Sectional Views of Right Angular Solids (7 hrs)\nSection of Solids (Prism, Cylinder, Pyramid, Cone), Auxiliary Views; Development of Surfaces of Right Regular Solids – Prism, Pyramid, Cylinder and Cone; Draw the Sectional Orthographic Views of Geometrical Solids, Objects From Industry and Dwellings (Foundation to Slab Only).\n\n📚 UNIT 5.0 – Isometric Projections (7 hrs)\nIsometric Views, Compound Solids; Principles of Isometric Projection, Isometric Scale, Conventions; Isometric Views of Lines, Planes, Simple Solids and Conversion of Isometric Views to Orthographic Views and Vice-Versa.\n\n📚 UNIT 6.0 – Overview of Computer Graphics (7 hrs)\nListing the Computer Technologies that Impact Graphical Communication; Theory of CAD Software [Such As: The Menu System, Toolbars (Standard, Object Properties, Draw, Modify and Dimension), Drawing Area (Background, Crosshairs, Coordinate System), Dialog Boxes and Windows, Shortcut Menus (Button Bars), The Command Line, The Status Bar, Different Methods of Zoom], Selecting and Erasing Objects; Isometric Views of Lines, Planes, Simple and Compound Solids.\n\n📘 TEXT / REFERENCE BOOKS:\n1. Engineering Drawing – N.D. Bhatt, Charotar Publishing House, 53rd Edition, ISBN: 978-9380358277\n2. A Textbook of Engineering Drawing – R.K. Dhawan, S. Chand Publishing, Revised Edition, ISBN: 978-8121929571\n3. Engineering Drawing and Graphics – K. Venugopal, V. Prabhu Raja, New Age International Publishers, 3rd Edition, ISBN: 978-8122430120\n4. Engineering Graphics with AutoCAD – D.M. Kulkarni, A.P. Rastogi, A.K. Sarkar, PHI Learning Pvt. Ltd., 1st Edition, ISBN: 978-8120337834"
},
"Innovation Project": {
  "type": "text",
  "text": "📘 COURSE CODE: 100109P\n📗 Subject: Innovation Project\n\n📚 COURSE OBJECTIVES:\n\n(a) Encouraging creativity and innovation: Foster a culture of creativity and innovation among engineering students through brainstorming sessions, design thinking exercises, and hands-on projects.\n\n(b) Enhancing problem-solving skills: Provide training on root cause analysis, critical thinking, and decision-making. Equip students to identify, analyze, and solve complex real-world problems.\n\n(c) Developing project management skills: Teach project planning, scheduling, budgeting, and risk management. Promote effective resource management, communication, and collaboration.\n\n(d) Promoting interdisciplinary collaboration: Encourage students from different engineering disciplines to work together on innovative projects to foster teamwork and diverse perspectives.\n\n(e) Facilitating practical application of engineering concepts: Enable students to apply theoretical knowledge to real-world projects, prototypes, or simulations and gain hands-on experience.\n\n📚 PRE-REQUISITE: Nil\n\n📚 COURSE OUTCOMES:\n\n1️⃣ Developed innovative projects: Students will create projects demonstrating creativity, problem-solving skills, and technical competence—through prototypes, models, or practical solutions.\n\n2️⃣ Improved critical thinking and problem-solving skills: Students will enhance their ability to analyze problems and develop feasible, impactful solutions.\n\n3️⃣ Enhanced project management and teamwork skills: Students will gain experience in planning, budgeting, and managing resources within a collaborative environment.\n\n4️⃣ Increased interdisciplinary knowledge and collaboration: Students will integrate knowledge from various disciplines to solve complex problems and work efficiently in diverse teams.\n\n5️⃣ Cultivated a mindset of innovation and entrepreneurship: Students will learn to identify opportunities, take risks, and implement ideas with commercial or societal impact.\n\n📚 LIST OF REPORTS:\n- Any topic related to an innovative project."
},
"Engineering Chemistry Lab": {
  "type": "text",
  "text": "📘 COURSE CODE: 100101P\n📗 Subject: Engineering Chemistry Lab\n\n📚 Perform any 10 Experiments:\n\n1️⃣ To estimate hardness of water by alkalinity method\n\n2️⃣ To estimate hardness of water by EDTA method\n\n3️⃣ To remove hardness of water by ion exchange method\n\n4️⃣ Determination of pH of a given acid solution using a standard sodium hydroxide solution\n\n5️⃣ Determination of surface tension and viscosity\n\n6️⃣ Chemical analysis of salt (Acid radical and basic radical)\n\n7️⃣ Adsorption of acetic acid by charcoal\n\n8️⃣ Test of adulteration of fat butter, sugar, turmeric powder, chilli powder and pepper\n\n9️⃣ Saponification/ acid value of an oil\n\n🔟 Identification of organic substances and their functional groups\n\n1️⃣1️⃣ Potentiometric determination of redox potentials and emf\n\n1️⃣2️⃣ Synthesis of drug/ polymer like ASPIRIN / Urea-formaldehyde resin\n\n1️⃣3️⃣ Thin layer chromatography\n\n1️⃣4️⃣ Analysis of flue gas by Orsat apparatus"
},
"English Language Lab": {
  "type": "text",
  "text": "📘 COURSE CODE: 100103P\n📗 Subject: English Language Lab\n\n📚 Perform any 10 Experiments:\n\nLanguage Lab of English includes Listening Comprehension, Reading Comprehension, Speaking Skills: Phonetics, International Phonetic Alphabet Symbols (IPAS), Sounds: Vowels and Consonants, Pronunciation, Intonation, Stress and Rhythm, Just A Minute Technique (JAM), Communication: Verbal and Non-Verbal; Ethical Usage of Artificial Intelligence, Self-Introduction: Social, Academic and Professional; Interview: Online and Offline; Oral Presentation, Debate, Group Discussion, Group Activities, and Brainstorming\n\n📚 Vocabulary Activities:\n\n1️⃣ Listening Comprehension and Speed (Software)\n\n2️⃣ Reading Comprehension and Speed (Software)\n\n3️⃣ Pronunciation: Learning and Test (Software)\n\n4️⃣ Self-Introduction: Social, Academic and Professional\n\n5️⃣ English Typing: Microsoft Word Document (MS Word), and Microsoft PowerPoint Presentation (PPT)\n\n6️⃣ Oral Presentation\n\n7️⃣ Interview: Online and Offline\n\n8️⃣ Just A Minute Technique (JAM) and Extempore\n\n9️⃣ Debate\n\n🔟 Group Discussion\n\n1️⃣1️⃣ Activities: Role Play, Peer Activities, and Group Activities\n\n1️⃣2️⃣ Anchoring and Addressing: an Assembly, a Meeting, a Seminar, a Party"
},
"Engineering Drawing Lab": {
  "type": "text",
  "text": "📘 COURSE CODE: 100104P\n📗 Subject: Engineering Drawing Lab\n\n📚 Perform any 10 Experiments:\n\n1️⃣ Dimensioning methods, different types of lines, construction of different polygons, dividing lines and angles into parts, use of stencil.\n\n2️⃣ Construction of Plane, Diagonal & Vernier Scales.\n\n3️⃣ Construction of Ellipses, Parabolas, and Hyperbolas using the general method.\n\n4️⃣ Construction of Cycloid, Epicycloid, Hypocycloid, and Involute of a circle.\n\n5️⃣ Projection of Points and Lines inclined to both planes.\n\n6️⃣ Projections of Planes (e.g., rectangular, triangular) in inclined positions.\n\n7️⃣ Projection of Solids (Prisms, Pyramids, Cones, and Cylinders).\n\n8️⃣ Drawing of Sections of Prisms, Cylinders, Pyramids, and Cones.\n\n9️⃣ Development of Surfaces for Prisms, Pyramids, Cylinders, and Cones.\n\n🔟 Construction of Isometric Views of Lines, Planes, and Simple Solids.\n\n1️⃣1️⃣ Introduction to CAD Software.\n\n1️⃣2️⃣ Use of CAD software to draw basic geometric shapes, apply dimensions, and modify objects."
},
  "2415501 Hydraulics": {
    "type": "text",
    "text": "A) Course Code:\n2415501 (T2415501 / P2415501 / S2415501)\n\nB) Course Title:\nHydraulics\n\nC) Pre-requisite Course(s):\nNone specified.\n\nD) Rationale:\nCivil, environmental, and transportation engineers must understand fluid flow behavior in pipes, channels, canals, notches, and weirs. This course provides foundational knowledge for solving real-world problems related to water seepage, discharge, and pressure. It supports advanced subjects like Irrigation, Water Resources Management, and Public Health Engineering.\n\nE) Course Outcomes (COs):\nAfter completing this course, students will be able to:\n\nCO-1: Measure fluid pressure in different situations.\n\nCO-2: Apply Bernoullis and Continuity Equations to fluid flow in closed conduits.\n\nCO-3: Use Darcy Weisbach Equation to determine head loss in pipes.\n\nCO-4: Design the most economical channel section using Chezys and Mannings formulae.\n\nCO-5: Calculate discharge through notches and weirs.\n\nF) Course Articulation Matrix (CAM):\nCOs\tPO-1 (Basic Knowledge)\tPO-2 (Problem Analysis)\tPO-3 (Design Solutions)\tPO-4 (Engineering Tools)\tPO-5 (Sustainability)\tPO-6 (Project Mgmt.)\tPO-7 (Lifelong Learning)\tPSO-1\tPSO-2\nCO-1\t3 (High)\t3\t-\t2\t3\t-\t1\t-\t-\nCO-2\t3\t-\t-\t2\t2\t-\t2\t-\t-\nCO-3\t3\t3\t2\t3\t3\t2\t2\t-\t-\nCO-4\t3\t2\t2\t2\t2\t2\t1\t-\t-\nCO-5\t3\t-\t1\t3\t3\t3\t2\t-\t-\n*(Legend: 3=High, 2=Medium, 1=Low, -=No mapping)*\n\nG) Teaching & Learning Scheme:\nComponent\tHours/Week\tTotal Hours\tCredits\nTheory (CI)\t3 (L) + 0 (T)\t48\t3\nPractical (LI)\t4\t64\t2\nTerm Work (TW) + Self-Learning (SL)\t2\t32\t1\nTotal\t9\t144\t6\n\nH) Assessment Scheme:\nComponent\tMarks\nTheory (TA)\t100\n- Progressive Theory Assessment (PTA)\t30\n- End Theory Assessment (ETA)\t70\nTerm Work & Self-Learning (TWA)\t50\n- Internal (40%)\t20\n- External (60%)\t30\nLab Assessment (LA)\t50\n- Progressive Lab Assessment (PLA)\t20\n- End Lab Assessment (ELA)\t30\nTotal\t200\n\nI) Course Curriculum (Theory - T2415501):\nUnit 1: Introduction, Hydrostatic Pressure & Measurement\nFluid properties (viscosity, density, surface tension).\n\nPressure types (Atmospheric, Gauge, Absolute).\n\nMeasurement using Piezometer, U-tube Manometer.\n\nTotal Pressure & Centre of Pressure calculations.\n\nUnit 2: Fluid Flow Parameters\nTypes of flow (Laminar/Turbulent, Steady/Unsteady).\n\nReynolds Number, Continuity Equation.\n\nBernoullis Theorem and applications.\n\nUnit 3: Flow Through Pipes\nMajor & Minor Head Losses (friction, bends, expansions).\n\nHydraulic Gradient Line (HGL) & Total Energy Line (TEL).\n\nVenturimeter, Orifice, Water Hammer effects.\n\nUnit 4: Open Channel Flow\nChezys & Mannings formulae for channel design.\n\nMost Economical Sections (Rectangular, Trapezoidal).\n\nSpecific Energy Diagram, Froudes Number.\n\nUnit 5: Notches & Weirs\nDischarge calculations (Rectangular, V-notch, Cipolletti weirs).\n\nCoefficients (Cd, Cc, Cv) and their relationships.\n\nJ) Practical Experiments (P2415501):\nViscosity measurement using Viscometer.\n\nPressure measurement using Piezometer & Manometers.\n\nVenturimeter for pipe discharge.\n\nOrifice coefficients (Cc, Cv, Cd).\n\nDischarge through V-notch & Rectangular weirs.\n\nReynolds Apparatus for flow type determination.\n\nFriction factor & Minor Losses in pipes.\n\nK) Term Work & Self-Learning (S2415501):\nAssignments: Numerical problems on fluid mechanics.\n\nMicro Projects:\n\nSurvey of canal structures (flow data, cross-sections).\n\nIndustry visit for pressure measurement devices.\n\nMarket survey of pipe materials (PVC, GI, HDPE).\n\nOther Activities:\n\nDemonstrations (videos, animations).\n\nField visits (dams, pumping stations).\n\nL) Major Lab Equipment:\nVenturimeter, Orifice, V-notch, U-tube Manometer, Reynolds Apparatus, Friction Factor Setup.\n\nM) Books & Resources:\nModi & Seth  Hydraulics & Fluid Mechanics\n\nRamamrutham  Fluid Mechanics & Hydraulic Machines\n\nNPTEL (IIT Lectures), TU Delft (Water Engineering Resources)\n\nFinal Notes:\n60% weightage for external assessment (Term Work & Lab).\n\nEmphasis on numerical problem-solving (each student gets unique values).\n\nIndustrial applications (pipeline design, irrigation systems)."
  },
  "2415502 RCC Structure": {
    "type": "text",
    "text": "A) Course Code:\n2415502 (T2415502 / P2415502 / S2415502)\n\nB) Course Title:\nRCC Structure\n\nC) Pre-requisite Courses:\nStrength of Material\n\nTheory of Structure\n\nConcrete Technology\n\nD) Rationale:\nInfrastructure development is vital for economic growth. This course equips students to design safe, durable reinforced concrete structures (buildings, bridges, etc.) by:\n\nUnderstanding design concepts and structural behavior.\n\nEnsuring quality supervision and on-site execution.\n\nIncorporating precast and pre-stressed concrete applications.\n\nE) Course Outcomes (COs):\nAfter completing this course, students will be able to:\n\nCO-1: Design singly reinforced rectangular beams (Limit State Method/Working Stress Method).\n\nCO-2: Design doubly reinforced rectangular beams (LSM).\n\nCO-3: Design shear reinforcement for beams as per IS 456:2000.\n\nCO-4: Design slabs (one-way, two-way, cantilever) under given loads.\n\nCO-5: Design axially loaded short columns and isolated square footings (IS 456:2000).\n\nF) Course Articulation Matrix (CAM):\nCOs\tPO-1 (Knowledge)\tPO-2 (Problem Analysis)\tPO-3 (Design)\tPO-4 (Tools)\tPO-5 (Sustainability)\tPO-6 (Mgmt.)\tPO-7 (Learning)\nCO-1\t3 (High)\t3\t2\t-\t1\t-\t1\nCO-2\t3\t3\t2\t-\t1\t-\t1\nCO-3\t3\t2\t2\t-\t1\t-\t1\nCO-4\t3\t3\t2\t-\t1\t-\t1\nCO-5\t3\t3\t2\t-\t1\t-\t1\n*(Legend: 3=High, 2=Medium, 1=Low, -=No mapping)*\n\nG) Teaching & Learning Scheme:\nComponent\tHours/Week\tTotal Hours\tCredits\nTheory (CI)\t3 (L) + 0 (T)\t48\t3\nPractical (LI)\t4\t64\t2\nTerm Work (TW) + Self-Learning (SL)\t2\t32\t1\nTotal\t9\t144\t6\nH) Assessment Scheme:\nComponent\tMarks\nTheory (TA)\t100\n- Progressive Theory Assessment (PTA)\t30\n- End Theory Assessment (ETA)\t70\nTerm Work & Self-Learning (TWA)\t50\n- Internal (40%)\t20\n- External (60%)\t30\nLab Assessment (LA)\t50\n- Progressive Lab Assessment (PLA)\t20\n- End Lab Assessment (ELA)\t30\nTotal\t200\nI) Theory Curriculum (T2415502):\nUnit 1: Introduction to RCC & Design Methods\nStress-strain curves for concrete & steel.\n\nWorking Stress Method (WSM) vs. Limit State Method (LSM).\n\nAnalysis of singly reinforced beams (under-reinforced/balanced/over-reinforced).\n\nUnit 2: Doubly Reinforced & Flanged Beams (LSM)\nNeed for doubly reinforced beams.\n\nAnalysis of T-beams/L-beams, effective flange width (IS 456:2000).\n\nUnit 3: Shear, Bond & Development Length\nShear reinforcement design (IS 456).\n\nBond stress, development length, lapping of bars.\n\nUnit 4: Slab Design (LSM)\nOne-way/cantilever/two-way slabs (IS Code method).\n\nChecks for deflection, shear, development length.\n\nUnit 5: Column & Footing Design (LSM)\nAxially loaded short columns (square/rectangular/circular).\n\nIsolated square footing design for flexure & shear.\n\nJ) Practical Experiments (P2415502):\nDraw stress-strain diagrams for singly/doubly reinforced beams.\n\nDesign shear reinforcement for beams.\n\nDesign slabs (cantilever, one-way, two-way).\n\nDesign axially loaded columns.\n\nSketch column footing types.\n\nK) Term Work & Activities (S2415502):\nAssignments: Numerical problems on beam/slab/column design.\n\nMicro Projects:\n\nStudy RCC design software (e.g., STAAD.Pro).\n\nSite visit to audit formwork/reinforcement practices.\n\nSeminars: Topics like earthquake-resistant design, FRP concrete.\n\nL) Key Books & Resources:\nUnnikrishna Pillai & Menon – Reinforced Concrete Design (McGraw Hill).\n\nIS 456:2000 – Code for RCC design.\n\nNPTEL Lectures (Online).\n\nM) Lab Equipment:\nDrawing boards, IS codebooks, design charts, software tools.\n\nN) Exam Pattern (Theory):\nUnit\tMarks (ETA)\n1\t14\n2\t14\n3\t11\n4\t14\n5\t17\nTotal\t70\n(20% Rote, 22% Understanding, 28% Application)"
  },
  {
  "Legend": [
    { "Code": "PTA", "Meaning": "Progressive Theory Assessment in class room (includes class test, mid-term test and quiz using online/offline modes)" },
    { "Code": "PLA", "Meaning": "Progressive Laboratory Assessment (includes process and product assessment using rating Scales and rubrics)" },
    { "Code": "TWA", "Meaning": "Term work & Self Learning Assessment" }
  ],
  "Courses": [
    {
      "Course Code": "T123",
      "Title": "Example Course",
      "Structure": { "L": 3, "T": 1, "P": 0, "Credits": 4 },
      "Assessment": [
        { "Type": "PTA", "Marks": 30 },
        { "Type": "PLA", "Marks": null },
        { "Type": "TWA", "Marks": 20 },
        { "Type": "ESE", "Marks": 50 }
      ]
    },
    {
      "Course Code": "P456",
      "Title": "Practical Course",
      "Structure": { "L": 0, "T": 0, "P": 4, "Credits": 2 },
      "Assessment": [
        { "Type": "PTA", "Marks": null },
        { "Type": "PLA", "Marks": 50 },
        { "Type": "TWA", "Marks": null },
        { "Type": "ESE", "Marks": 50 }
      ]
    }
  ]
}

}





